# SpecUtils Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
SpecUtils Members
SpecUtils Class Methods See Also
---
The SpecUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAllSpecs | Gets the identifiers of all specs. |
| GetParameterType | **Obsolete.** Gets the ParameterType value corresponding to the given spec identifier. |
| GetSpecTypeId | **Obsolete.** Gets the ForgeTypeId identifying the spec corresponding to the given ParameterType value. |
| IsSpec | Checks whether a ForgeTypeId identifies a spec. |
| IsValidDataType | Returns true if the given ForgeTypeId identifies a valid parameter data type. |

# See Also
SpecUtils Class
Autodesk.Revit.DB Namespace